minhcrafters/usb_audio_dac_stm32f4/STM32CubeMX/STM32F4/STM32CubeMX/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"
#include "usb_device.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "cs43l22.h"
#include "led_pwm.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define AUDIO_BUFFER_SIZE 4096
#define AUDIO_BUFFER_HALF_SIZE (AUDIO_BUFFER_SIZE / 2)
#define INCOMING_BUFFER_SIZE (AUDIO_BUFFER_SIZE * 2)
#define AUDIO_CHANNELS 2
#define BUFFER_TIMEOUT_MS 100

#define ENABLE_REVERB

#ifdef ENABLE_REVERB
#define REVERB_DRY_LEVEL 256
#define REVERB_WET_LEVEL 128
#define REVERB_DECAY 215
#define REVERB_DAMPING 51
#define REVERB_PREDELAY_MS 30
#define REVERB_DIFFUSION 128
#define REVERB_STEREO_SPREAD 23

#define MAX_COMB_SIZE 1600
#define MAX_AP_SIZE 600
#define MAX_PREDELAY 2400
#endif
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

I2C_HandleTypeDef hi2c1;

I2S_HandleTypeDef hi2s3;
DMA_HandleTypeDef hdma_spi3_tx;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim4;

/* USER CODE BEGIN PV */
volatile int16_t buffer_audio[AUDIO_BUFFER_SIZE * AUDIO_CHANNELS]; // Single audio buffer
volatile uint32_t audio_buffer_w_ptr = 0; // Write pointer
volatile uint32_t last_data_time = 0; // Last time data was received
volatile int16_t incoming_buffer[INCOMING_BUFFER_SIZE * AUDIO_CHANNELS]; // Incoming data buffer
volatile uint32_t incoming_w_ptr = 0; // Incoming write pointer
volatile uint32_t incoming_r_ptr = 0; // Incoming read pointer
volatile int16_t last_L = 0; // Last left sample
volatile int16_t last_R = 0; // Last right sample
// volatile uint8_t is_paused = 0; // Pause state

#ifdef ENABLE_REVERB
// Buffers
int16_t comb_L[4][MAX_COMB_SIZE];
int16_t comb_R[4][MAX_COMB_SIZE];
int16_t ap_L[2][MAX_AP_SIZE];
int16_t ap_R[2][MAX_AP_SIZE];
int16_t predelay_buf_L[MAX_PREDELAY];
int16_t predelay_buf_R[MAX_PREDELAY];

// Indices
uint16_t comb_idx_L[4] = { 0 };
uint16_t comb_idx_R[4] = { 0 };
uint16_t ap_idx_L[2] = { 0 };
uint16_t ap_idx_R[2] = { 0 };
uint16_t pre_idx = 0;

// Filter States
int16_t comb_damp_L[4] = { 0 };
int16_t comb_damp_R[4] = { 0 };

// Tunings
const uint16_t comb_lens[4] = { 1116, 1188, 1277, 1356 };
const uint16_t ap_lens[2] = { 556, 441 };

volatile uint16_t reverb_dry_level = REVERB_DRY_LEVEL;
volatile uint16_t reverb_wet_level = REVERB_WET_LEVEL;
#endif
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2S3_Init(void);
static void MX_SPI1_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM4_Init(void);
/* USER CODE BEGIN PFP */
void ApplyDSP(int16_t in_L, int16_t in_R, int16_t* out_L, int16_t* out_R);
void ProcessAudioChunk(int16_t* output_buffer, uint32_t count);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{

    /* USER CODE BEGIN 1 */

    /* USER CODE END 1 */

    /* MCU Configuration--------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* USER CODE BEGIN Init */

    /* USER CODE END Init */

    /* Configure the system clock */
    SystemClock_Config();

    /* USER CODE BEGIN SysInit */

    /* USER CODE END SysInit */

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_DMA_Init();
    MX_I2C1_Init();
    MX_I2S3_Init();
    MX_SPI1_Init();
    MX_USB_DEVICE_Init();
    MX_ADC1_Init();
    MX_TIM4_Init();
    /* USER CODE BEGIN 2 */
    LED_PWM_Init(&htim4);

#ifdef ENABLE_REVERB
    HAL_ADC_Init(&hadc1);
#endif

    cs43l22_init();

    memset((void*)buffer_audio, 0, sizeof(buffer_audio));
    memset((void*)incoming_buffer, 0, sizeof(incoming_buffer));
#ifdef ENABLE_REVERB
    memset((void*)comb_L, 0, sizeof(comb_L));
    memset((void*)comb_R, 0, sizeof(comb_R));
    memset((void*)ap_L, 0, sizeof(ap_L));
    memset((void*)ap_R, 0, sizeof(ap_R));
    memset((void*)predelay_buf_L, 0, sizeof(predelay_buf_L));
    memset((void*)predelay_buf_R, 0, sizeof(predelay_buf_R));
#endif

    cs43l22_play((void*)buffer_audio, AUDIO_BUFFER_SIZE * AUDIO_CHANNELS);

    /* USER CODE END 2 */

    /* Infinite loop */
    /* USER CODE BEGIN WHILE */
    while (1) {
        /* USER CODE END WHILE */

        /* USER CODE BEGIN 3 */
        // if (HAL_GPIO_ReadPin(B1_GPIO_Port, B1_Pin) == GPIO_PIN_SET) {
        //     HAL_Delay(50); // Debounce
        //     if (HAL_GPIO_ReadPin(B1_GPIO_Port, B1_Pin) == GPIO_PIN_SET) {
        //         is_paused = !is_paused;
        //         // Wait for release
        //         while (HAL_GPIO_ReadPin(B1_GPIO_Port, B1_Pin) == GPIO_PIN_SET) {
        //             HAL_Delay(10);
        //         }
        //     }
        // }
        // if (HAL_GetTick() - last_data_time > BUFFER_TIMEOUT_MS) {
        //     memset((void*)buffer_audio, 0, sizeof(buffer_audio));
        //     memset((void*)incoming_buffer, 0, sizeof(incoming_buffer));
        // }

#ifdef ENABLE_REVERB
        static uint32_t wet_accum = 0;
        static uint32_t dry_accum = 0;
        static uint8_t first_run = 1;

