minhcrafters/usb_audio_dac_stm32f4/STM32CubeMX/STM32F4/STM32CubeMX/Src/main.c
    // Damping (Lowpass on feedback)
    *damp_state = ((int32_t)output * (256 - REVERB_DAMPING) + (int32_t)(*damp_state) * REVERB_DAMPING) >> 8;

    int32_t feedback = input + ((*damp_state * REVERB_DECAY) >> 8);

    // Clip
    if (feedback > 32767)
        feedback = 32767;
    if (feedback < -32768)
        feedback = -32768;

    buffer[*idx] = (int16_t)feedback;

    (*idx)++;
    if (*idx >= size)
        *idx = 0;

    return output;
}

int16_t AllpassProcess(int16_t input, int16_t* buffer, uint16_t* idx, uint16_t size)
{
    int16_t buf_out = buffer[*idx];

    int32_t feedback = input + ((buf_out * REVERB_DIFFUSION) >> 8);

    // Clip
    if (feedback > 32767)
        feedback = 32767;
    if (feedback < -32768)
        feedback = -32768;

    buffer[*idx] = (int16_t)feedback;

    int32_t output = buf_out - ((feedback * REVERB_DIFFUSION) >> 8);

    // Clip
    if (output > 32767)
        output = 32767;
    if (output < -32768)
        output = -32768;

    (*idx)++;
    if (*idx >= size)
        *idx = 0;

    return (int16_t)output;
}
#endif

void ApplyDSP(int16_t in_L, int16_t in_R, int16_t* out_L, int16_t* out_R)
{
#ifdef ENABLE_REVERB
    predelay_buf_L[pre_idx] = in_L;
    predelay_buf_R[pre_idx] = in_R;

    // Calculate read index for predelay
    uint16_t pre_read_idx = pre_idx; // 0ms
    uint16_t delay_samples = REVERB_PREDELAY_MS * 48; // 48 samples per ms
    if (delay_samples > MAX_PREDELAY)
        delay_samples = MAX_PREDELAY;

    if (pre_idx >= delay_samples)
        pre_read_idx = pre_idx - delay_samples;
    else
        pre_read_idx = MAX_PREDELAY - (delay_samples - pre_idx);

    int16_t dry_L = in_L;
    int16_t dry_R = in_R;

    int16_t wet_in_L = predelay_buf_L[pre_read_idx];
    int16_t wet_in_R = predelay_buf_R[pre_read_idx];

    pre_idx++;
    if (pre_idx >= MAX_PREDELAY)
        pre_idx = 0;

    int32_t accum_L = 0;
    int32_t accum_R = 0;

    for (int i = 0; i < 4; i++) {
        accum_L += CombProcess(wet_in_L, comb_L[i], &comb_idx_L[i], comb_lens[i], &comb_damp_L[i]);
        accum_R += CombProcess(wet_in_R, comb_R[i], &comb_idx_R[i], comb_lens[i] + REVERB_STEREO_SPREAD, &comb_damp_R[i]);
    }

    // Scale down accumulator to prevent massive clipping
    accum_L /= 4;
    accum_R /= 4;

    int16_t ap_out_L = (int16_t)accum_L;
    int16_t ap_out_R = (int16_t)accum_R;

    for (int i = 0; i < 2; i++) {
        ap_out_L = AllpassProcess(ap_out_L, ap_L[i], &ap_idx_L[i], ap_lens[i]);
        ap_out_R = AllpassProcess(ap_out_R, ap_R[i], &ap_idx_R[i], ap_lens[i] + REVERB_STEREO_SPREAD);
    }

    int32_t final_L = ((dry_L * reverb_dry_level) >> 8) + ((ap_out_L * reverb_wet_level) >> 8);
    int32_t final_R = ((dry_R * reverb_dry_level) >> 8) + ((ap_out_R * reverb_wet_level) >> 8);

    if (final_L > 32767)
        final_L = 32767;
    if (final_L < -32768)
        final_L = -32768;
    if (final_R > 32767)
        final_R = 32767;
    if (final_R < -32768)
        final_R = -32768;

    *out_L = (int16_t)final_L;
    *out_R = (int16_t)final_R;
#else
    *out_L = in_L;
    *out_R = in_R;
#endif
}

static inline uint32_t rb_used(uint32_t w, uint32_t r, uint32_t n)
{
    return (w >= r) ? (w - r) : (n - (r - w));
}
static inline uint32_t rb_free(uint32_t w, uint32_t r, uint32_t n)
{
    return (n - 1U) - rb_used(w, r, n);
}

void CDC_On_Receive(uint8_t* Buf, uint32_t* Len)
{
    LED_PWM_SetBrightness(LED_GREEN, 100);

    uint32_t bytes = *Len & ~3U; // multiple of 4
    if (bytes < 4)
        return;

    uint32_t frames = bytes / 4U;
    if (frames == 0)
        return;

    // Snapshot pointers once
    uint32_t w = incoming_w_ptr;
    uint32_t r = incoming_r_ptr;

    uint32_t free_frames = rb_free(w, r, INCOMING_BUFFER_SIZE);
    if (frames > free_frames) {
        frames = free_frames; // drop overflow
        bytes = frames * 4U;
        if (bytes == 0)
            return;
    }

    last_data_time = HAL_GetTick();

    // Raw byte ring over incoming_buffer (int16_t interleaved stereo)
    uint8_t* dst = (uint8_t*)incoming_buffer;
    const uint32_t cap_bytes = INCOMING_BUFFER_SIZE * 4U; // 4 bytes per frame
    uint32_t w_byte = w * 4U;

    uint32_t first = cap_bytes - w_byte;
    if (first > bytes)
        first = bytes;

    memcpy(dst + w_byte, Buf, first);
    if (bytes > first) {
        memcpy(dst, Buf + first, bytes - first);
    }

    // Ensure data is visible before publishing w_ptr
    __DMB();

    incoming_w_ptr = (w + frames) % INCOMING_BUFFER_SIZE;

    LED_PWM_SetBrightness(LED_GREEN, 0);
}

void ProcessAudioChunk(int16_t* output_buffer, uint32_t count)
{
    // if (is_paused) {
    //     memset((void*)output_buffer, 0, count * AUDIO_CHANNELS * sizeof(int16_t));
    //     return;
    // }

    for (uint32_t i = 0; i < count; i++) {
        int16_t in_L, in_R;
        if (incoming_r_ptr != incoming_w_ptr) {
            // Data available
            in_L = incoming_buffer[incoming_r_ptr * AUDIO_CHANNELS];
            in_R = incoming_buffer[incoming_r_ptr * AUDIO_CHANNELS + 1];
            incoming_r_ptr = (incoming_r_ptr + 1) % INCOMING_BUFFER_SIZE;
        } else {
            // No data, feed silence
            in_L = 0;
            in_R = 0;
        }

        int16_t out_L, out_R;
        ApplyDSP(in_L, in_R, &out_L, &out_R);

        last_L = out_L;
        last_R = out_R;

        output_buffer[i * AUDIO_CHANNELS] = out_L;
        output_buffer[i * AUDIO_CHANNELS + 1] = out_R;
    }
}

void AUDIO_I2S_TxHalfCpltCallback(void)
{
    ProcessAudioChunk((int16_t*)&buffer_audio[0], AUDIO_BUFFER_HALF_SIZE);
}

void AUDIO_I2S_TxCpltCallback(void)
{
    ProcessAudioChunk((int16_t*)&buffer_audio[AUDIO_BUFFER_HALF_SIZE * AUDIO_CHANNELS], AUDIO_BUFFER_HALF_SIZE);
}
/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void)
{
    /* USER CODE BEGIN Error_Handler_Debug */
    /* User can add his own implementation to report the HAL error return state */
    __disable_irq();
    while (1) {
        HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, GPIO_PIN_SET);
        HAL_Delay(1000);
        HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, GPIO_PIN_RESET);
        HAL_Delay(1000);
    }
    /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t* file, uint32_t line)
{
    /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line
       number, ex: printf("Wrong parameters value: file %s on line %d\r\n", file,
       line) */
    /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
